modm-ext/archive-stmicro-svd/header_stm32f070c6t6.svd
      <register>
        <name>EXTICR.0</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EXTI0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EXTI1</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EXTI2</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EXTI3</name>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>EXTICR.1</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EXTI4</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EXTI5</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EXTI6</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EXTI7</name>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>EXTICR.2</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EXTI8</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EXTI9</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EXTI10</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EXTI11</name>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>EXTICR.3</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EXTI12</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EXTI13</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EXTI14</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EXTI15</name>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CFGR2</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LOCKUP_LOCK</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SRAM_PARITY_LOCK</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SRAM_PEF</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>EXTI</name>
      <baseAddress>0x40010400</baseAddress>
      <register>
        <name>IMR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MR0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR17</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR18</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR19</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>EMR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MR0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR17</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR18</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MR19</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RTSR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TR0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR16</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR17</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR19</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FTSR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TR0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR16</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR17</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TR19</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SWIER</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SWIER0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER16</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER17</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWIER19</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PR0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR16</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR17</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR19</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>ADC1</name>
      <baseAddress>0x40012400</baseAddress>
      <register>
        <name>ISR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADRDY</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOSMP</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOC</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOS</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVR</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD1</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IER</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADRDYIE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOSMPIE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOCIE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOSIE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVRIE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD1IE</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDIS</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADSTART</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADSTP</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADCAL</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
